---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrent
source: html/b2db22ea-1058-3288-2268-3063f6b5fe5e.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrent Property

The TrueCurrent value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueCurrent { get; }
```

## Remarks
This property is used to retrieve the TrueCurrent value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!